<h2>Робота зі змінними:</h2>
<?php
$some = 5;
echo $some;

$some_value = 10;
echo $some_value;
?>
<br>
<?php
echo 'Результат:';
echo $some + $some_value;
?>
<br>
<?php
$var = 2.7868968;
echo $var;
?>
<br>
<?php
$var = 2.7868968e-3;
echo $var;
?>
<br>
<?php
// Присвоєння одного значення усім перемінним
$one = $two = $three = $four = $five = $six = $seven = 500;
echo $one;
echo $two;
echo $three;
echo $four;
echo $five;
echo $six;
echo $seven;
?>
<br>
<?php
// У PHP, як і у деяких мов програмування у синтаксисі присутні подвійні, одиночні та зворотні кавички - "",'' та ``
// Якщо необхідно динамічно вивести значення змінної у тексті - використовуємо подвійні кавички,
// одинарні - не виведуть значення змінної, а скомпілюють змінну як текст
$number = 5;
echo "$number - це число.";
?>
<br>
<?php
// Якщо необхідно вивести текст у лапках - можемо використовувати одинарні кавички
echo "'12178728' - це число."; // виведе '12178728' - це число.
?>
<br>
<?php
// Якщо необхідно вивести якийсь знак, його необхідно екранувати за допомогою \ - зворотній слеш
echo "\$number - це екранований запис.";  // виведе $number - це екранований запис.
echo "\"$number\" - це екранований запис."; // виведе "5" - це екранований запис.
?>
<br>
<?php
// Якщо необхідно вивести значенні змінної та поруч якісь символи - використовуємо {}
echo "{$number}5"; // виведе 55
?>
<br>
<p>Вивід команди операційної системи "ls":</p>
<?php
// За допомогою зворотніх кавичок - `` передаються команди операціної системи
echo `ls`;
?>
<?php
/*
PHP є мовою з динамічною типізацією.
Це означає, що тип даних змінної виводиться під час виконання.
В PHP не треба вказувати перед змінною тип даних.

У PHP є десять базових типів даних:

bool ( логічний тип )
int ( цілі числа )
float ( дрібні числа )
string ( строки )
array ( масиви )
object ( об’єкти )
callable ( функції )
mixed ( будь-який тип )
resource ( ресурси )
null ( відсутність значення )

З цих типів даних перші чотири є скалярними: bool, int, float, string.

Булеві типи можна записувати як TRue, FALSE

Об'єм рядка обмежується об'мом пам'яті, що відводиться під php скрипт.
Це 128 мегабайт, достатньо велика кількість тексту

Якщо значення змінної - це число, яке починається з нуля, то це число із вісімкової системи числення.
Вісімко́ва систе́ма чи́слення — позиційна цілочисельна система числення з основою 8.
Для представлення чисел в ній використовуються цифри від 0 до 7.
Вісімкова система часто використовується в галузях, пов'язаних з цифровими пристроями.

Якщо значення змінної - це число, яке починається з 0x, то це число із шістнадцяткової системи числення.
Шістнадцяткова систе́ма чи́слення — це позиційна система числення з основою 16.
Тобто кожне число в ній записується за допомогою 16 символів.
Арабські цифри від 0 до 9 відповідають значенням від нуля до дев'яти, а 6 літер латинської абетки A, B, C, D, E, F відповідають значенням від десяти до п'ятнадцяти.

Якщо змінні не ініціалізована значенням, то їй присвоюється null
*/
?>
